02-codeigniter/app/Controllers/Users.php

    public function index($id = false)
    {
        return view('Users/crud', [
            'user' => $this->userModel->find($id),
            'users' => $this->userModel->findAll(0, 100)
        ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `users`

    public function create()
    {
        $data = [
            'login' => $_POST["login"],
            'password' => sha1($_POST["password"])
        ];

        $this->userModel->insert($data);

        return view('Users/crud', [
            'users' => $this->userModel->findAll(0, 100),
            'infoMessage' => (object) ["message" => "User created successfully", "class" => "success"]
        ]);
---
INSERT INTO `users` (`login`, `password`, `tstamp_create`, `tstamp_update`) VALUES ('three', 'b802f384302cb24fbab0a44997e820bf2e8507bb', '2023-04-16 21:49:55', '2023-04-16 21:49:55')
SELECT *
FROM `users`

    public function update()
    {
        $user = $this->userModel->find($_POST["id-edit"]);
        if (!empty($user))
        {
            $data = [
                'login' => $_POST["login"],
                'password' => sha1($_POST["password"])
            ];
            $this->userModel->where("id = " . $_POST["id-edit"])->set($data)->update();

            return view('Users/crud', [
                'users' => $this->userModel->findAll(0, 100),
                'infoMessage' => (object) ["message" => "User updated successfully", "class" => "success"]
            ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
UPDATE `users` SET `login` = 'one', `password` = 'fe05bcdcdc4928012781a5f1a2a77cbb5398e106', `tstamp_update` = '2023-04-16 21:48:33'
WHERE `id` = 1
SELECT *
FROM `users`
WHERE `id` = 1

    public function delete($id = false)
    {
        $user = $this->userModel->find($id);
        if (!empty($user))
        {
            $this->userModel->where("id = " . $id)->delete();

            return view('Users/crud', [
                'users' => $this->userModel->findAll(0, 100),
                'infoMessage' => (object) ["message" => "User deleted successfully", "class" => "success"]
            ]);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '16'
DELETE FROM `users`
WHERE `id` = 16
SELECT *
FROM `users`